<?php
/**
*
* @package Support Toolkit
* @version $Id: common.php 482 2010-07-05 10:07:42Z erikfrerejean $
* @copyright (c) 2009 phpBB Group
* @license http://opensource.org/licenses/gpl-license.php GNU Public License
*
*
* @Ελληνική μετάφραση από την ομάδα μετάφρασης του phpbbgr.com. http://phpbbgr.com
*
*/

/**
* DO NOT CHANGE
*/
if (!defined('IN_PHPBB'))
{
   exit;
}

if (empty($lang) || !is_array($lang))
{
   $lang = array();
}

// DEVELOPERS PLEASE NOTE
//
// All language files should use UTF-8 as their encoding and the files must not contain a BOM.
//
// Placeholders can now contain order information, e.g. instead of
// 'Page %s of %s' you can (and should) write 'Page %1$s of %2$s', this allows
// translators to re-order the output of data while ensuring it remains correct
//
// You do not need this where single placeholders are used, e.g. 'Message %d' is fine
// equally where a string contains only two placeholders which are used to wrap text
// in a url you again do not need to specify an order e.g., 'Click %sHERE%s' is fine
//
// Some characters you may want to copy&paste:
// ’ » “ ” …
//

$lang = array_merge($lang, array(
   'BACK_TOOL'							=> 'Πίσω στο τελευταίο εργαλείο',
   'BOARD_FOUNDER_ONLY'					=> 'Μόνο Ιδρυτές μπορούν να έχουν πρόσβαση στην Εργαλειοθήκη υποστήριξης.',

   'CAT_ADMIN'							=> 'Εργαλεία διαχειριστή',
   'CAT_ADMIN_EXPLAIN'					=> 'Τα Εργαλεία διαχειριστή μπορούν να χρησιμοποιηθούν από έναν διαχειριστή για να ρυθμίσουν συγκεκριμένες λειτουργίες της Δ. Συζήτησής και να λύσουν απλά προβλήματα.',
   'CAT_DEV'							=> 'Εργαλεία προγραμματισμού',
   'CAT_DEV_EXPLAIN'					=> 'Τα εργαλεία προγραμματισμού μπορούν να χρησιμοποιηθούν από Προγραμματιστές του phpBB και δημιουργούς MOD για να διενεργήσουν κοινές λειτουργίες.',
   'CAT_ERK'							=> 'Εργαλειοθήκη Άμεσης Επιδιόρθωσης',
   'CAT_ERK_EXPLAIN'					=> 'Η εργαλειοθήκη άμεσης επιδιόρθωσης είναι ένα ξεχωριστό πακέτο από το STK που δημιουργήθηκε για να κάνει κάποιους ελέγχους που μπορούν να εντοπίσουν προβλήματα στο phpBB σας, που πιθανόν να το εμποδίζουν από την ομαλή του λειτουργία. Κάντε κλικ <a href="%s">εδώ</a> για να τρέξετε το εργαλείο.',
   'CAT_MAIN'							=> 'Κύρια κατηγορία',
   'CAT_MAIN_EXPLAIN'					=> 'Η εργαλειοθήκη υποστήριξης (STK) μπορεί να χρησιμοποιηθεί για να επιλυθούν απλά προβλήματα σε μία ενεργή εγκατάσταση phpBB 3.0.x. Χρησιμοποιείται ώς ένας δεύτερος πίνακας ελέγχου διαχειριστή, που παρέχει στον Διαχειριστή ένα σετ εργαλείων για την επίλυση απλών προβλημάτων που μπορεί να αποτρέπει το phpBB3 από το να λειτουργεί φυσιολογικά.',
   'CAT_SUPPORT'						=> 'Εργαλεία Υποστήριξης',
   'CAT_SUPPORT_EXPLAIN'				=> 'Τα εργαλεία υποστήριξης μπορούν να χρησιμοποιηθούν για την επαναφορά μίας phpBB 3.0.x εγκατάστασης που δεν λειτουργεί πλέον κανονικά.',
   'CAT_USERGROUP'						=> 'Εργαλεία Χρηστών/Ομάδων',
   'CAT_USERGROUP_EXPLAIN'				=> 'Τα εργαλεία Χρηστών και Ομάδων μπορούν να χρησιμοποιηθούν για την διαχείριση των χρηστών και των ομάδων σε ένα τρόπο που δεν είναι εφικτός σε ένα απλό phpBB 3.0.x (απουσία mod).',
   'CONFIG_NOT_FOUND'					=> 'Το αρχείο ρυθμίσεων του STK δεν μπορεί να φορτωθεί. Παρακαλώ ελέγξτε την εγκατάστασή σας',

   'DOWNLOAD_PASS'						=> 'Μεταφόρτωση του αρχείου κωδικού.',

   'EMERGENCY_LOGIN_NAME'				=> 'Σύνδεση ανάγκης STK',
   'ERK'								=> 'Εργαλειοθήκη Άμεσης Επιδιόρθωσης',

   'FAIL_REMOVE_PASSWD'					=> 'Δεν μπορεί να αφαιρεθεί το ληγμένο αρχείο κωδικού. Παρακαλώ διαγράψτε αυτό το αρχείο χειροκίνητα!',

   'GEN_PASS_FAILED'					=> 'Η εργαλειοθήκη Υποστήριξης δεν ήταν δυνατό να δημιουργήσει νέο κωδικό. Παρακαλώ ξαναδοκιμάστε.',
   'GEN_PASS_FILE'						=> 'Δημιουργία αρχείου κωδικού.',
   'GEN_PASS_FILE_EXPLAIN'				=> 'Αν δεν μπορείτε να συνδεθείτε στο phpBB καθόλου, μπορείτε μα χρησιμοποιήσετε τον εσωτερικό τρόπο πιστοποίησης για την εργαλειοθήκη υποστήριξης. Για να χρησιμοποιήσετε αυτή τη μέθοδο πρέπει να <a href="%s"><strong>δημιουργήσετε</strong></a> ένα νέο αρχείο κωδικού.',

   'INCORRECT_CLASS'					=> 'Λάθος κλάση στο: stk/tools/%1$s.%2$s',
   'INCORRECT_PASSWORD'					=> 'Ο κωδικός είναι λάθος',
   'INCORRECT_PHPBB_VERSION'			=> 'Η έκδοση του phpBB δεν είναι συμβατή με αυτό το εργαλείο. Η εγκατάσταση του phpBB πρέπει να είναι έκδοση %1$s ή μεταγενέστερη για να λειτουργήσει αυτό το εργαλείο',

   'LOGIN_STK_SUCCESS'					=> 'Έχετε πιστοποιηθεί επιτυχώς και θα μεταβείτε τώρα στην Εργαλειοθήκη Υποστήριξης.',

   'NOTICE'								=> 'Ειδοποίηση',
   'NO_VERSION_FILE'					=> 'Η εργαλειοθήκη υποστήριξης (STK) δεν ήταν να καθορίσει την τελευταία έκδοση. Παρακαλώ πηγαίνετε στον <a href="http://phpbb.com/support/stk">τομέα της εργαλειοθήκης υποστήριξης στο phpBB.com</a> και επαληθεύστε ότι χρησιμοποιείτε την νεότερη έκδοση πριν χρησιμοποιήσετε το STK.',

   'PASS_GENERATED'						=> 'Το αρχείο κωδικού του STK έχει δημιουργηθεί επιτυχώς!<br/>Ο κωδικός που δημιουργήθηκε για σας είναι: <em>%1$s</em><br />Ο κωδικός λήγει στις: <span style="text-decoration: underline;">%2$s</span>. Μετά από αυτό τον καιρό <strong>πρέπει</strong> να δημιουργήσετε ένα νέο αρχείο κωδικού για να συνεχίσετε να χρησιμοποιείτε την σύνδεση ανάγκης!<br /><br />Χρησιμοποιείστε το ακόλουθο κουμπί για να μεταφορτώσετε το αρχείο. Όταν το κάνετε αυτό πρέπει να το ανεβάσετε στον server σας στον φάκελο "stk"',
   'PASS_GENERATED_REDIRECT'			=> 'Όταν ανεβάσετε το αρχείο κωδικού στην σωστή τοποθεσία, κάνετε κλικ <a href="%s">εδώ</a> για να μεταβείτε πίσω στην σελίδα σύνδεσης.',
   'PLUGIN_INCOMPATIBLE_PHPBB_VERSION'	=> 'Αυτό το εργαλείο δεν είναι συμβαό με την έκδοση του phpBB που χρησιμοποιείτε',
   'PROCEED_TO_STK'						=> '%sΜετάβαση στην εργαλειοθήκη υποστήριξης%s',

   'STK_FOUNDER_ONLY'					=> 'Πρέπει να επαναπιστοποιηθείτε πριν μπορέσετε να χρησιμοποιήσετε την εργαλειοθήκη υποστήριξης.',
   'STK_LOGIN'							=> 'Σύνδεση Εργαλειοθήκηης υποστήριξης',
   'STK_LOGIN_WAIT'						=> 'Θα πρέπει να περιμένετε τρία δευτερόλεπτα πριν προσπαθήσετε να συνδεθείτε πάλι. Παρακαλώ δοκιμάστε ξανά.',
   'STK_LOGOUT'							=> 'Αποσύνδεση από STK',
   'STK_LOGOUT_SUCCESS'					=> 'Αποσυνδεθήκατε επιτυχώς από την εργαλειοθήκη υποστήριξης.',
   'STK_NON_LOGIN'						=> 'Συνδεθείτε για να έχετε πρόσβαση στο STK.',
   'STK_OUTDATED'						=> 'Η εγκατάσταση της εργαλειοθήκης υποστήριξης φαίνετε να είναι παλιά. Η νεότερη διαθέσιμη ένδοση είναι <strong style="color: #008000;">%1$s</strong>, ενώ η έκδοση που έχετε εγκατεστημένη είναι <strong style="color: #FF0000;">%2$s</strong>.<br /><br />Λόγω του μεγάλου αντίκτυπου αυτού του εργαλείου στο phpBB, έχει απενεργοποιηθεί μέχρι να γίνει η ενημέρωσή του. Προτείνουμε όλα τα λογισμικά πάνω στον server σας να τα κρατάτε ενημερωμένα. Για περισσότερες πληροφορίες που αφορούν τις νεότερες ενημερώσεις, παρακαλώ συμβουλευτείτε την <a href="%3$s">δημοσίευση έκδοσης</a>.<br /><br /><em>Αν δείτε αυτή την προειδοποίηση μετά από μια ενημέρωση της εργαλειοθήκης υποστήριξης, κάντε κλικ <a href="%4$s">εδώ</a> για να γίνει εκκαθάριση της προσωρινής μνήμης ελέγχου έκδοσης.</em>',
   'SUPPORT_TOOL_KIT'					=> 'Εργαλειοθήκη υποστήριξης',
   'SUPPORT_TOOL_KIT_INDEX'				=> 'Κατάλογος εργαλειοθήκης υποστήριξης',
   'SUPPORT_TOOL_KIT_PASSWORD'			=> 'Κωδικός',
   'SUPPORT_TOOL_KIT_PASSWORD_EXPLAIN'	=> 'Καθώς δεν είστε συνδεδεμένος στο phpBB3 πρέπει να γίνει πιστοποίηση οτι είστε ο ιδρυτής εισάγωντας τον κωδικό της εργαλειοθήκης υποστήριξης.<br /><br /><strong>Τα cookies ΠΡΕΠΕΙ να επιτρέπονται από τον πειρηγητή σας ή αλλιώς δεν θα μπορέσετε να παραμείνετε συνδεδεμένος.</strong>',

   'TOOL_INCLUTION_NOT_FOUND'			=> 'Αυτό το εργαλείο προσπαθεί να φορτώσει ένα αρχείο που δεν υπάρχει: %1$s',
   'TOOL_NAME'							=> 'Όναμα εργαλείου',
   'TOOL_NOT_AVAILABLE'					=> 'Το ζητούμενο εργαλείο δεν είναι διαθέσιμο!',

   'USING_STK_LOGIN'					=> 'Είστε συνδεδεμένος χρησιμοποιώντας την εσωτερική μέθοδο επικύρωσης του STK. Σας συμβουλεύουμε να χρησιμοποιείτε αυτή τη μέθοδο <strong>μόνο</strong> αν δεν μπορείτε να συνδεθείτε μέσα από το phpBB.<br />Για να απενεργοποιήσετε αυτή την μέθοδο επικύρωσης κάντε κλικ <a href="%1$s">εδώ</a>.',
));

?>